# Part 1

The file "Purchase_Data.csv" contains purchase data at a Chinese supermarket for various products.  Read this csv into a dataframe called df_data and use the head() method to check that you have read in the data correctly. Make sure you import pandas.

In [15]:
# ...existing code...
import pandas as pd

df_data = pd.read_csv("Purchase_Data.csv")
df_data.head()
# ...existing code...

,invoice_number,invoice_time,store_id,product_id,category_id,num_item,price
0,2.020000e+11,7/15/15 10:45,G816,7000300,210101,1.0,2.0
1,2.020000e+11,7/15/15 12:16,G816,7070884,70203,1.0,2.0
2,2.020000e+11,7/15/15 12:16,G816,7070884,70203,1.0,2.0
3,2.020000e+11,7/15/15 12:16,G816,7070891,70401,1.0,6.0
4,2.020000e+11,7/15/15 12:16,G816,7090363,70401,1.0,6.0

Use the dtypes attribute to view how each column is stored

In [16]:
# ...existing code...
#Write your code here
df_data.dtypes
# ...existing code...

invoice_number    float64
invoice_time       object
store_id           object
product_id          int64
category_id         int64
num_item          float64
price             float64
dtype: object

Slice the first two columns using .loc and store the result in a variable called result_1.

In [17]:
# ...existing code...
#Write you code here
result_1 = df_data.loc[:, df_data.columns[:2]]
result_1
# ...existing code...

      invoice_number   invoice_time
0       2.020000e+11  7/15/15 10:45
1       2.020000e+11  7/15/15 12:16
2       2.020000e+11  7/15/15 12:16
3       2.020000e+11  7/15/15 12:16
4       2.020000e+11  7/15/15 12:16
...              ...            ...
5377    2.020000e+11   9/5/15 23:07
5378    2.020000e+11   9/5/15 23:23
5379    2.020000e+11   9/5/15 23:24
5380    2.020000e+11   9/5/15 23:32
5381    2.020000e+11   9/5/15 23:38

[5382 rows x 2 columns]

Slice the first two rows using .loc and store the result in a variable called result_2.

In [18]:
# ...existing code...
#Write your code here
result_2 = df_data.loc[:1, :]
result_2
# ...existing code...

,invoice_number,invoice_time,store_id,product_id,category_id,num_item,price
0,2.020000e+11,7/15/15 10:45,G816,7000300,210101,1.0,2.0
1,2.020000e+11,7/15/15 12:16,G816,7070884,70203,1.0,2.0

Slice the first four rows and the first five columns and store the result in a variable called result_3.

In [19]:
# ...existing code...
#Write your code here
result_3 = df_data.loc[:3, df_data.columns[:5]]
result_3
# ...existing code...

   invoice_number   invoice_time store_id  product_id  category_id
0    2.020000e+11  7/15/15 10:45     G816     7000300       210101
1    2.020000e+11  7/15/15 12:16     G816     7070884        70203
2    2.020000e+11  7/15/15 12:16     G816     7070884        70203
3    2.020000e+11  7/15/15 12:16     G816     7070891        70401

Slice rows 0,4,6 and columns invoice time and price and store the result in variable called result_4.

In [20]:
result_4 = df_data.loc[[0, 4, 6], ['invoice_time', 'price']]

print(result_4)

    invoice_time  price
0  7/15/15 10:45    2.0
4  7/15/15 12:16    6.0
6  7/15/15 15:28    2.0

Store the number rows in a variable called num_rows.

In [8]:

# ...existing code...
num_rows = df_data.shape[0]
num_rows
# ...existing code...

5382

Print out the last row of the data to dataframe. **Hint:** use the variable num_rows from the previous exercise.

In [9]:

# ...existing code...
#Write your code here
last_row = df_data.iloc[num_rows-1:num_rows]  # returns a DataFrame for the last row
last_row
# ...existing code...

,invoice_number,invoice_time,store_id,product_id,category_id,num_item,price
5381,2.020000e+11,9/5/15 23:38,G619,23030206,210101,1.0,2.0

# Part 2

Compute the average and max price charged.  Store the results in variables called avg_price and max_price

In [21]:
# ...existing code...
#Write your code here
avg_price = df_data['price'].mean()
max_price = df_data['price'].max()

avg_price, max_price
# ...existing code...

(np.float64(3.1920522110741363), np.float64(6.01))

Compute the average price and average number of items purchased with only a single call to the mean() method. Store these averages in avg_price and avg_num_items.

In [22]:
# ...existing code...
#Write you code here
means = df_data[['price', 'num_item']].mean()
avg_price = means['price']
avg_num_items = means['num_item']

avg_price, avg_num_items
# ...existing code...

(np.float64(3.1920522110741363), np.float64(1.2983091787439613))

Create a column called "total", which is the product of the price and num_item columns.

In [23]:
# ...existing code...
#Write your code here
df_data['total'] = df_data['price'] * df_data['num_item']
df_data.head()
# ...existing code...

,invoice_number,invoice_time,store_id,product_id,category_id,num_item,price,total
0,2.020000e+11,7/15/15 10:45,G816,7000300,210101,1.0,2.0,2.0
1,2.020000e+11,7/15/15 12:16,G816,7070884,70203,1.0,2.0,2.0
2,2.020000e+11,7/15/15 12:16,G816,7070884,70203,1.0,2.0,2.0
3,2.020000e+11,7/15/15 12:16,G816,7070891,70401,1.0,6.0,6.0
4,2.020000e+11,7/15/15 12:16,G816,7090363,70401,1.0,6.0,6.0

What is the avgerage price of the three most expensive purchases?

In [24]:
# ...existing code...
#Write your code here
avg_top3_price = df_data['price'].nlargest(3).mean()
avg_top3_price
# ...existing code...

np.float64(6.003333333333333)

How many different products are there?

In [25]:
# ...existing code...
#Write your code here
# detect a likely product column, fallback to most unique object column
candidates = [c for c in df_data.columns if any(k in c.lower() for k in ('product','item','name'))]
if candidates:
    prod_col = candidates[0]
else:
    obj_cols = df_data.select_dtypes(include='object').columns.tolist()
    prod_col = max(obj_cols, key=lambda c: df_data[c].nunique()) if obj_cols else None

num_products = df_data[prod_col].nunique() if prod_col is not None else 0
num_products
# ...existing code...

53

Find the difference between the mean and median of the column total.  Use the describe() method and then index the dataframe it returns.

In [26]:
# ...existing code...
#Write your code here
descr = df_data['total'].describe()
mean_median_diff = descr['mean'] - descr['50%']
mean_median_diff
# ...existing code...

np.float64(0.9318078781127839)

Use the drop() method to delete the column total from the dataframe df_data.

In [27]:
# ...existing code...
df_data.drop(columns=['total'], inplace=True)
df_data.head()
# ...existing code...

,invoice_number,invoice_time,store_id,product_id,category_id,num_item,price
0,2.020000e+11,7/15/15 10:45,G816,7000300,210101,1.0,2.0
1,2.020000e+11,7/15/15 12:16,G816,7070884,70203,1.0,2.0
2,2.020000e+11,7/15/15 12:16,G816,7070884,70203,1.0,2.0
3,2.020000e+11,7/15/15 12:16,G816,7070891,70401,1.0,6.0
4,2.020000e+11,7/15/15 12:16,G816,7090363,70401,1.0,6.0

Let's dig a little deeper into the data set and answer some basic question.

In [28]:
# ...existing code...
#Write your code here
df_data['invoice_time'] = pd.to_datetime(df_data['invoice_time'])
print(df_data.dtypes)

df_data['DOW'] = df_data['invoice_time'].dt.day_name()
df_data['Month'] = df_data['invoice_time'].dt.month_name()
df_data.head()

num_purchases_wed = df_data['DOW'].value_counts().get('Wednesday', 0)
num_purchases_wed
# ...existing code...

invoice_number           float64
invoice_time      datetime64[ns]
store_id                  object
product_id                 int64
category_id                int64
num_item                 float64
price                    float64
dtype: object

C:\Users\User\AppData\Local\Temp\ipykernel_3520\1727317069.py:3: UserWarning: Could not infer format, so each element will be parsed individually, falling back to `dateutil`. To ensure parsing is consistent and as-expected, please specify a format.
  df_data['invoice_time'] = pd.to_datetime(df_data['invoice_time'])

np.int64(959)

First, covert the column invoice time to a datetime column. Print out the new column types to make sure this was done correctly

In [29]:
# ...existing code...
df_data['invoice_time'] = pd.to_datetime(df_data['invoice_time'])
print(df_data.dtypes)
# ...existing code...#Write your code here

invoice_number           float64
invoice_time      datetime64[ns]
store_id                  object
product_id                 int64
category_id                int64
num_item                 float64
price                    float64
DOW                       object
Month                     object
dtype: object

Next, let's create columns called "DOW" and "Month", which store the corresponding weekday and month of the invoice respectively.  Print the head of the dataframe to make sure this was done correctly.

In [30]:
# ...existing code...
df_data['DOW'] = df_data['invoice_time'].dt.day_name()
df_data['Month'] = df_data['invoice_time'].dt.month_name()
df_data.head()
# ...existing code...

,invoice_number,invoice_time,store_id,product_id,category_id,num_item,price,DOW,Month
0,2.020000e+11,2015-07-15 10:45:00,G816,7000300,210101,1.0,2.0,Wednesday,July
1,2.020000e+11,2015-07-15 12:16:00,G816,7070884,70203,1.0,2.0,Wednesday,July
2,2.020000e+11,2015-07-15 12:16:00,G816,7070884,70203,1.0,2.0,Wednesday,July
3,2.020000e+11,2015-07-15 12:16:00,G816,7070891,70401,1.0,6.0,Wednesday,July
4,2.020000e+11,2015-07-15 12:16:00,G816,7090363,70401,1.0,6.0,Wednesday,July

Create a variable called num_purchases_wed, which stores the number of purchases made on Wednesday?  You should use value_counts and then index the series it return.

In [32]:
# ...existing code...
#Write your code here
num_purchases_wed = df_data['DOW'].value_counts()['Wednesday']
num_purchases_wed
# ...existing code...

np.int64(959)

# Part 3

In this set of practice exercises, we will be working with a demographic data regarding the passengers aboard the Titanic.  Read in the data frame and use the head() method to check that it was read in correctly.

In [33]:
# ...existing code...
import pandas as pd
import glob, os

# try to find a Titanic csv in the current folder (fallback to the first csv)
csvs = glob.glob(os.path.join(os.getcwd(), "*.csv"))
tfile = next((f for f in csvs if 'titanic' in os.path.basename(f).lower()), (csvs[0] if csvs else None))

if tfile is None:
    raise FileNotFoundError("No CSV file found in the working directory.")
df_titanic = pd.read_csv(tfile)
df_titanic.head()
# ...existing code...

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

Use the rename method to change the column "Name" to "Passenger_Name" and the column "Ticket" to "Ticket_Num".

In [34]:
# ...existing code...
df_titanic.rename(columns={'Name': 'Passenger_Name', 'Ticket': 'Ticket_Num'}, inplace=True)
df_titanic.head()
# ...existing code...

,PassengerId,Pclass,Passenger_Name,Sex,Age,SibSp,Parch,Ticket_Num,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

Change the index of the df_titanic to the column PasengerID.

In [35]:
# ...existing code...
#Write your code here
possible = ['PassengerId','PassengerID','Passenger_Id','Passenger Id','PasengerID','PasengerId']
col = next((c for c in possible if c in df_titanic.columns), None)
if col is None:
    col = next((c for c in df_titanic.columns if 'passeng' in c.lower()), None)
if col is None:
    raise KeyError("Passenger ID column not found in df_titanic.")
df_titanic.set_index(col, inplace=True)
df_titanic.head()
# ...existing code...

,Pclass,Passenger_Name,Sex,Age,SibSp,Parch,Ticket_Num,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,
892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

Select the name of passenger 896

In [36]:
# ...existing code...
#Write your code here
# robustly find the name column
name_col = 'Passenger_Name' if 'Passenger_Name' in df_titanic.columns else next((c for c in df_titanic.columns if 'name' in c.lower()), None)

# get the original passenger id column name (it was set as the index)
pid_col = df_titanic.index.name
tmp = df_titanic.reset_index()

# try numeric 896 first, then string '896' as fallback
if pid_col in tmp.columns:
    row = tmp[tmp[pid_col] == 896]
    if row.empty:
        row = tmp[tmp[pid_col] == '896']
else:
    row = tmp[tmp.index == 896]
    if row.empty:
        row = tmp[tmp.index == '896']

name_896 = row[name_col].iloc[0] if (not row.empty and name_col in row.columns) else None
name_896
# ...existing code...

'Hirvonen, Mrs. Alexander (Helga E Lindqvist)'

Change the index back to row numbers but making sure that we don't lose the PassengerId column.

In [37]:
# ...existing code...
#Write your code here
# Reset index to default row numbers and make sure the PassengerId column is kept
df_titanic.reset_index(inplace=True)

# Optional: standardize the passenger id column name to "PassengerId" if a candidate exists
pid_candidates = ['PassengerId','PassengerID','Passenger_Id','Passenger Id','PasengerID','PasengerId']
for c in pid_candidates:
    if c in df_titanic.columns and c != 'PassengerId':
        df_titanic.rename(columns={c: 'PassengerId'}, inplace=True)
        break

df_titanic.head()
# ...existing code...

,PassengerId,Pclass,Passenger_Name,Sex,Age,SibSp,Parch,Ticket_Num,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

How many missing entries are there in the Age column? Use the isnull() method and recall than Booleans are exactly like 1s (True) and 0s (False).

In [38]:
# ...existing code...
#Write you code here
age_col = next((c for c in df_titanic.columns if 'age' in c.lower()), None)
if age_col is None:
    missing_age = 0
else:
    missing_age = df_titanic[age_col].isnull().sum()
missing_age
# ...existing code...

np.int64(86)

Compute the avg age of passengers ignoring the missing data.

In [39]:
# ...existing code...
#Write your code here
age_col = next((c for c in df_titanic.columns if 'age' in c.lower()), None)
if age_col is None:
    avg_age = None
else:
    avg_age = df_titanic[age_col].mean()  # mean() ignores NaNs by default
avg_age
# ...existing code...

np.float64(30.272590361445783)

Using the fillna() method replace the missing values in the Age column with the mean.

In [40]:
# ...existing code...
age_col = next((c for c in df_titanic.columns if 'age' in c.lower()), None)
if age_col is None:
    print("Age column not found")
else:
    mean_age = df_titanic[age_col].mean()
    df_titanic[age_col].fillna(mean_age, inplace=True)
df_titanic.head()
# ...existing code...

C:\Users\User\AppData\Local\Temp\ipykernel_3520\1897037549.py:7: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df_titanic[age_col].fillna(mean_age, inplace=True)

,PassengerId,Pclass,Passenger_Name,Sex,Age,SibSp,Parch,Ticket_Num,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

What is the average age of the 5 oldest passengers? The reset_index method will be helpful here.

In [41]:
#Write your code here
age_col = next((c for c in df_titanic.columns if 'age' in c.lower()), None)
if age_col is None:
    print("Age column not found")
else:
    # Sort by age descending and get mean of top 5
    avg_oldest_5 = df_titanic[age_col].nlargest(5).mean()
    print(f"Average age of 5 oldest passengers: {avg_oldest_5:.2f}")

Average age of 5 oldest passengers: 67.00